//
//  Const.swift
//  CareTogether
//
//  Created by HeinHtet on 05/04/2020.
//  Copyright © 2020 HEINHTET. All rights reserved.
//

import Foundation
//<string name="identified_caretogether">ထိတွေ့ခဲ့သောလူများထဲမှ ဝူဟမ်ဗိုင်းရပ်စ် သံသယလူနာအဖြစ် စောင့်ကြည့်ခံရသူ </string>
//<string name="identified_caretogether2"> ဦး တွေ့ရှီထားပါသည်။</string>
//<string name="safe_one">၁။ အိမ်တွင်လုံခြုံစွာနေခြင်းဖြင့် ရောဂါပိုးမပြန့်နှံ့အောင်ကူညီပါ။</string>
//<string name="safe_two">၂။ မဖြစ်မနေ အပြင်ထွက်ရမည်ဆိုပါက Mask တပ်ပြီးမှထွက်ပါ။</string>
//<string name="safe_three">၃။ ကျန်းမာရေးနှင့်အားကစားဝန်ကြီးဌာနမှ လမ်းညွှန်ချက်များအတိုင်း သေချာလိုက်နာဆောင်ရွက်ပါ။</string>
//<string name="safe_four">၄။ ရောဂါအခြေအနေပြင်းထန်ပါက ဖုန်း <u>၀၆၇-၃၄၂၀၂၆၈</u> သို့ ဆက်သွယ် အကြောင်းကြားပါရန်။</string>
//
//

class Const {
    static let instance = Const()
    
    func indentifiedCount(count : Int)  -> String {
        return  "နီးစပ်ဖူးသူများထဲမှ ဝူဟန် ဗိုင်းရပ်စ် ရောဂါပိုးတွေ့ရှိသူ  (\(count)) တွေ့ရှိထားပါသည်။"
    }
    
    let safeInfo = "၁။ အိမ်တွင်လုံခြုံစွာနေခြင်းဖြင့် ရောဂါပိုးမပြန့်နှံ့အောင်ကူညီပါ။\n ၂။ မဖြစ်မနေ အပြင်ထွက်ရမည်ဆိုပါက Mask တပ်ပြီးမှထွက်ပါ။\n ၃။ ကျန်းမာရေးနှင့်အားကစားဝန်ကြီးဌာနမှ လမ်းညွှန်ချက်များအတိုင်း သေချာလိုက်နာဆောင်ရွက်ပါ။ \n ၄။ ရောဂါအခြေအနေပြင်းထန်ပါက ဖုန်း <u>၀၆၇-၃၄၂၀၂၆၈</u> သို့ ဆက်သွယ် အကြောင်းကြားပါရန်"
    let permissionRequestBleAndLocation = "သင့်တည်နေရာနဲ့ တွေ့ဆုံဖူးသောသူများအားရယူနိုင်ရန်အတွက် Location နှင့် Bluetooth တို့အားဖွင့်ထားရန်လိုအပ်ပီး Permission အားခွင့်ပြုပေးရန်လိုအပ်ပါသည်"
    
    let perimssionRequestBle = "သင်နှင့် တွေ့ဆုံဖူးသောသူများအားရယူနိုင်ရန်အတွက်  Bluetooth အားဖွင့်ထားရန်လိုအပ်ပီး Permission အားခွင့်ပြုပေးရန်လိုအပ်ပါသည်"
    
    let permissionRequestLocation = "သင့်တည်နေရာ အားရယူနိုင်ရန်အတွက် Location အားဖွင့်ထားရန်လိုအပ်ပီး Permission အားခွင့်ပြုပေးရန်လိုအပ်ပါသည်"
    
    let sawPerson = "မှစ၍ ယနေ့အချိန်အထိ တည်နေရာပေါ်မူတည်၍ ( App သုံးသူအချင်းချင်း )​နီးစပ်ဖူးသူဦးရေ"
    
    let term = "  အချက်အလက်ဆိုင်ရာမူဝါ​ဒ"
    
    let term_message = "(၁) အသုံးပြုသူ ၏ ဖုန်းတွင်း၌ ထည့်သွင်းထားသော အချက်အလက်များအား Encrypt ပြုလုပ်ထားသောကြောင့် သက်ဆိုင်ရာ ကျန်းမာရေးဝန်ကြီးဌာရှိ ထိန်းချုပ် နည်းပညာစနစ်ဖြင့်သာ ဖတ်ရှု့ စစ်ဆေးခွင့်ရှိစေရန် စီစဥ်ဆောင်ရွက်ထားပါသည်။ \n\n (၂) ဤ Mobile Application သည် အသုံးပြုသူ၏ ကိုယ်ရေးအချက်အလက် (ဖုန်းစာအုပ်၊ ဓါတ်ပုံ၊ ဗီဒီယို၊ Message၊ Email အစရှိသော အချက်အလက်) များကို ရယူသိမ်းဆည်းခြင်း (လုံးဝ) မပြုလုပ်ပါ။ \n\n (၃)​ အသုံးပြုသူ၏ ဖုန်းနံပါတ် နှင့်တကွ အသုံးပြုသူ၏ ပုဂ္ဂိုလ်ရေးဆိုင်ရာ အခြားသော အချက်အလက်များအား ဤ အရေးပေါ်ကာလ လုပ်ငန်းစဥ်နှင့် မသက်ဆိုင်သောသူများမှရယူခွင့်မရှိစေရန်စီစဥ်ထားပါသည်။ \n\n (၄) ဤ မိုဘိုင်းဖုန်း  Application  စနစ်တွင် အသုံးပြုသူကိုယ်တိုင်ဖြည့်သွင်းထားသော ဖုန်းနံပါတ် ကိုသာ အရေးပေါ် ကိစ္စဖြစ်စဥ်၌ ဆက်သွယ်ရန် အတွက်သာအသုံးပြုပါမည်။ \n\n (၅) အသုံးပြုသူနှင့် ထိတွေ့ခဲ့သော ပုဂ္ဂိုလ် များ၏ Mobile Application  တွင်အသုံးပြုသူ ၏ ဖုန်းနံပါတ် မှအပ အခြား အချက်အလက်များ ကိုရယူနိုင်လိမ့်မည်မဟုတ်ပါ။ \n\n (၆) ရောဂါလက္ခဏာ ရှိသည်ဟု သံသယရှိသူ နှင့် တွေ့ဆုံခဲ့ခြင်း (သို့မဟုတ်) အသုံးပြုသူကိုယ်တိုင် ရောဂါလက္ခာဏာ တွေ့ကြုံခံစားနေရသည်ဟု သံသယ ရှိပါက အသုံးပြုသူ၏ ဖုန်း၌ သိမ်းဆည်းထားသော  အချက်အလက်များကို ကျန်းမာရေးဝန်ကြီးဌာနမှ တာဝန်ရှိသူများအားကူးယူခွင့်ပေး ၍ကူညီရပါမည်။ \n\n (၇) အသုံးပြုသူဤ ဖုန်းနံပါတ်နှင့် တကွ အခြားသော အချက်အလက်များအား ကျန်းမာရေးနှင့်အားကစားဝန်ကြီးဌာန မှအပ စီးပွားရေးသမားများ နှင့် ကြော်ငြာလုပ်ငန်း လုပ်ကိုင်သူများ ထံသို့  (မည်သည့် နည်းလမ်းဖြင့်မဆို) ရောင်းချခြင်း/ ပေးဝေခြင်း ပြုလုပ်မည်မဟုတ်ပါ။ \n\n (၈) ဤ  Application  အား ပယ်ဖျက်လိုက်ပါက အသုံးပြုသူကိုယ်တိုင် အပါအဝင် အသုံးပြုသူနှင့် တွေ့ထိပါတ်သက်ခဲ့သူများ ၏ အချက်အလက်များ (အားလုံး) အပြီးတိုင်ပျက်သွားပါလိမ့်မည်။ \n\n (၉) ဤ Application ထည့်သွင်းထားသော Mobile Phone ရှိ Database မှအချက်အလက်များအား ကျန်းမာရေးဝန်ကြီးဌာန မှ တာဝန်ရှိသူများသာ ကူးယူခွင့်ရှိမည်ဖြစ်ပြီး အခြားသော လူပုဂ္ဂိုလ် / အသင်း/ အဖွဲ့အစည်း များအား ကူးယူခွင့်ပြုရန် မလိုအပ်ပါ။ \n\n (၁၀) ဤ Mobile Application  သည် ကပ်ရောဂါ ရင်ဆိုင်နေရသော ကျွန်ုပ်တို့ မြန်မာနိုင်ငံအတွက် အရေးပေါ်အသုံးပြုရန်သာ ဖန်တီး ပြုလုပ် ထားခြင်းဖြစ်ပြီး အသုံးပြုသူများ၏ ကိုယ်ရေးအချက်အလက်အား အခြားသော ကိုယ်ကျိုးစီးပွားရေးလုပ်ငန်းများနှင့် အဖျက်အမှောက်လုပ်ငန်းများ တွင် မည်သည့်နည်းလမ်းဖြင့်မဆို ကူးယူအသုံးချခွင့်၊ ဝေမျှခွင့်၊ ဆင့်ပွားပြုလုပ်ခွင့် မရှိပါ။ \n\n (၁၁) ဤ Mobile Application ရှိ အချက်အလက်များ ကို ကျန်းမာရေးနှင့်အားကစားဝင်ကြီးဌာန မှ သံသယလူနာ ရှာဖွေရန် အတွက် တရားဝင်နည်းလမ်းဖြင့် အသုံးပြုခွင့် အပြည့်အဝရှိပါသည်။ \n\n (၁၂) ဤ Mobile Application အားဖန်တီးပြုလုပ်သော Za Information Technology Co.,Ltd.  သည် နည်းပညာဆိုင်ရာ တည်ဆောက်ဖန်တီးမှု ဉာဏမူပိုင်ခွင့် အပြည့်ရှိသော်လည်း သတင်းအချက်အလက်များအား မည်သည့်နည်းလမ်းဖြင့်မဆို ကူးယူ/မျှဝေ အသုံးပြုခွင့် မရှိပါ။ \n\n (၁၃) ဤ  Mobile Application  အားအသုံးပြုစဥ်၌ Bluetooth အားဖွင့်ထားရန်လိုအပ် ပြီး Bluetooth ID ပြောင်းလဲသွားနိုင်ပါသည်။ \n\n (၁၄) ဤ Mobile Application သည် အသုံးပြုသူ၏ ဖုန်းအား ပျက်ဆီးစေနိုင်သော အဖျက်အမှောက်လုပ်ငန်းစဥ်များ ဆောင်ရွက်ထား သည့် စနစ်များမပါရှိပါ။ \n\n (၁၅) ဤ Mobile Application အားတည်ဆောက်ထားသည့် နည်းပညာ အခြေခံအဆောက်အအုံအား တတ်သိနားလည်သော ပညာရှင်များ မှစစ်ဆေးနိုင်စေရန် Github ၌ Open Source  ဖွင့်လှစ်ပေးထားပါသည်။"
    let about = "Application အကြောင်း"
    
    let unknownError = "လုပ်ဆောင်မှုမအောင်မြင်ပါ"
}
